{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "(": 4,
      ")": 5,
      "+": 6,
      ",": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "S": 22,
      "[": 23,
      "a": 24,
      "d": 25,
      "e": 26,
      "h": 27,
      "i": 28,
      "m": 29,
      "p": 30,
      "q": 31,
      "r": 32,
      "s": 33,
      "t": 34,
      "u": 35,
      "x": 36,
      "10": 37,
      "12": 38,
      "40": 39,
      "30": 40,
      "50": 41,
      "20": 42,
      "60": 43,
      "15": 44,
      "70": 45,
      "25": 46,
      "35": 47,
      "80": 48,
      "16": 49,
      "55": 50,
      "qr": 51,
      "sqr": 52,
      "sqrt": 53,
      "14": 54,
      "13": 55,
      "65": 56,
      "24": 57,
      "100": 58,
      "120": 59,
      "110": 60,
      "36": 61,
      "75": 62,
      "18": 63,
      "32": 64,
      "28": 65,
      "45": 66,
      "130": 67,
      "22": 68,
      "11": 69,
      "48": 70,
      "27": 71,
      "140": 72,
      "34": 73,
      "72": 74,
      "90": 75,
      "17": 76,
      "54": 77,
      "64": 78,
      "38": 79,
      "pi": 80,
      "42": 81,
      "125": 82,
      "52": 83,
      "105": 84,
      ")/": 85,
      "21": 86,
      "56": 87,
      "150": 88,
      "115": 89,
      "26": 90,
      "58": 91,
      "19": 92,
      "57": 93,
      "62": 94,
      "39": 95,
      "66": 96,
      "68": 97,
      "85": 98,
      "33": 99,
      "37": 100,
      "44": 101,
      "76": 102,
      "46": 103,
      "135": 104,
      "29": 105,
      "2sqrt": 106,
      "31": 107,
      "108": 108,
      "145": 109,
      "180": 110,
      "3sqrt": 111,
      "47": 112,
      "49": 113,
      "23": 114,
      "63": 115,
      "128": 116,
      "112": 117,
      "53": 118,
      "92": 119,
      "122": 120,
      "43": 121,
      "67": 122,
      "88": 123,
      "95": 124,
      "104": 125,
      "123": 126,
      "126": 127,
      "144": 128,
      "360": 129,
      "59": 130,
      "96": 131,
      "124": 132,
      "137": 133,
      "41": 134,
      "51": 135,
      "78": 136,
      "79": 137,
      "84": 138,
      "93": 139,
      "102": 140,
      "107": 141,
      "138": 142,
      "116": 143,
      "260": 144,
      "71": 145,
      "73": 146,
      "77": 147,
      "142": 148,
      "136": 149,
      "117": 150,
      "119": 151,
      "160": 152,
      "114": 153,
      "210": 154,
      "240": 155,
      "216": 156,
      "61": 157,
      "74": 158,
      "8pi": 159,
      "200": 160,
      "170": 161,
      "230": 162,
      "2pi": 163,
      "5sqrt": 164,
      "81": 165,
      "91": 166,
      "is": 167,
      "103": 168,
      "106": 169,
      "109": 170,
      "127": 171,
      "300": 172,
      "162": 173,
      "118": 174,
      "250": 175,
      "3pi": 176,
      "4sqrt": 177,
      "69": 178,
      "83": 179,
      "86": 180,
      "99": 181,
      "re": 182,
      "500": 183,
      "60pi": 184,
      "152": 185,
      "155": 186,
      "156": 187,
      "255": 188,
      "141": 189,
      "143": 190,
      "134": 191,
      "1200": 192,
      "193": 193,
      "374": 194,
      "2400": 195,
      "()": 196,
      "(:": 197,
      "))": 198,
      "02": 199,
      "05": 200,
      "06": 201,
      "08": 202,
      "113": 203,
      "212": 204,
      "220": 205,
      "215": 206,
      "270": 207,
      "225": 208,
      "235": 209,
      "238": 210,
      "239": 211,
      "237": 212,
      "231": 213,
      "2200": 214,
      "3S": 215,
      "310": 216,
      "340": 217,
      "315": 218,
      "325": 219,
      "318": 220,
      "311": 221,
      "338": 222,
      "3108": 223,
      "420": 224,
      "470": 225,
      "418": 226,
      "4pi": 227,
      "525": 228,
      "575": 229,
      "5pi": 230,
      "625": 231,
      "732": 232,
      "738": 233,
      "89": 234,
      "855": 235,
      "8sqrt": 236,
      "94": 237,
      "97": 238,
      "98": 239,
      "9pi": 240,
      "at": 241,
      "hat": 242,
      "ire": 243,
      "qu": 244,
      "that": 245,
      "10pi": 246,
      "121": 247,
      "129": 248,
      "12pi": 249,
      "408": 250,
      "305": 251,
      "205": 252,
      "207": 253,
      "20a": 254,
      "2010": 255,
      "151": 256,
      "153": 257,
      "154": 258,
      "158": 259,
      "159": 260,
      "1520": 261,
      "15sqrt": 262,
      "15pi": 263,
      "1574": 264,
      "707": 265,
      "251": 266,
      "259": 267,
      "357": 268,
      "164": 269,
      "165": 270,
      "166": 271,
      "167": 272,
      "168": 273,
      "169": 274,
      "16sqrt": 275,
      "16pi": 276,
      "147": 277,
      "149": 278,
      "14sqrt": 279,
      "132": 280,
      "133": 281,
      "139": 282,
      "13sqrt": 283,
      "13pi": 284,
      "246": 285,
      "188": 286,
      "189": 287,
      "32pi": 288,
      "288": 289,
      "222": 290,
      "272": 291,
      "273": 292,
      "27pi": 293,
      "34pi": 294,
      "174": 295,
      "178": 296,
      "17sqrt": 297,
      "17pi": 298,
      "646": 299
    },
    "merges": [
      [
        "1",
        "0"
      ],
      [
        "1",
        "2"
      ],
      [
        "4",
        "0"
      ],
      [
        "3",
        "0"
      ],
      [
        "5",
        "0"
      ],
      [
        "2",
        "0"
      ],
      [
        "6",
        "0"
      ],
      [
        "1",
        "5"
      ],
      [
        "7",
        "0"
      ],
      [
        "2",
        "5"
      ],
      [
        "3",
        "5"
      ],
      [
        "8",
        "0"
      ],
      [
        "1",
        "6"
      ],
      [
        "5",
        "5"
      ],
      [
        "q",
        "r"
      ],
      [
        "s",
        "qr"
      ],
      [
        "sqr",
        "t"
      ],
      [
        "1",
        "4"
      ],
      [
        "1",
        "3"
      ],
      [
        "6",
        "5"
      ],
      [
        "2",
        "4"
      ],
      [
        "10",
        "0"
      ],
      [
        "12",
        "0"
      ],
      [
        "1",
        "10"
      ],
      [
        "3",
        "6"
      ],
      [
        "7",
        "5"
      ],
      [
        "1",
        "8"
      ],
      [
        "3",
        "2"
      ],
      [
        "2",
        "8"
      ],
      [
        "4",
        "5"
      ],
      [
        "1",
        "30"
      ],
      [
        "2",
        "2"
      ],
      [
        "1",
        "1"
      ],
      [
        "4",
        "8"
      ],
      [
        "2",
        "7"
      ],
      [
        "1",
        "40"
      ],
      [
        "3",
        "4"
      ],
      [
        "7",
        "2"
      ],
      [
        "9",
        "0"
      ],
      [
        "1",
        "7"
      ],
      [
        "5",
        "4"
      ],
      [
        "6",
        "4"
      ],
      [
        "3",
        "8"
      ],
      [
        "p",
        "i"
      ],
      [
        "4",
        "2"
      ],
      [
        "12",
        "5"
      ],
      [
        "5",
        "2"
      ],
      [
        "10",
        "5"
      ],
      [
        ")",
        "/"
      ],
      [
        "2",
        "1"
      ],
      [
        "5",
        "6"
      ],
      [
        "1",
        "50"
      ],
      [
        "1",
        "15"
      ],
      [
        "2",
        "6"
      ],
      [
        "5",
        "8"
      ],
      [
        "1",
        "9"
      ],
      [
        "5",
        "7"
      ],
      [
        "6",
        "2"
      ],
      [
        "3",
        "9"
      ],
      [
        "6",
        "6"
      ],
      [
        "6",
        "8"
      ],
      [
        "8",
        "5"
      ],
      [
        "3",
        "3"
      ],
      [
        "3",
        "7"
      ],
      [
        "4",
        "4"
      ],
      [
        "7",
        "6"
      ],
      [
        "4",
        "6"
      ],
      [
        "1",
        "35"
      ],
      [
        "2",
        "9"
      ],
      [
        "2",
        "sqrt"
      ],
      [
        "3",
        "1"
      ],
      [
        "10",
        "8"
      ],
      [
        "14",
        "5"
      ],
      [
        "1",
        "80"
      ],
      [
        "3",
        "sqrt"
      ],
      [
        "4",
        "7"
      ],
      [
        "4",
        "9"
      ],
      [
        "2",
        "3"
      ],
      [
        "6",
        "3"
      ],
      [
        "12",
        "8"
      ],
      [
        "1",
        "12"
      ],
      [
        "5",
        "3"
      ],
      [
        "9",
        "2"
      ],
      [
        "12",
        "2"
      ],
      [
        "4",
        "3"
      ],
      [
        "6",
        "7"
      ],
      [
        "8",
        "8"
      ],
      [
        "9",
        "5"
      ],
      [
        "10",
        "4"
      ],
      [
        "12",
        "3"
      ],
      [
        "12",
        "6"
      ],
      [
        "14",
        "4"
      ],
      [
        "3",
        "60"
      ],
      [
        "5",
        "9"
      ],
      [
        "9",
        "6"
      ],
      [
        "12",
        "4"
      ],
      [
        "13",
        "7"
      ],
      [
        "4",
        "1"
      ],
      [
        "5",
        "1"
      ],
      [
        "7",
        "8"
      ],
      [
        "7",
        "9"
      ],
      [
        "8",
        "4"
      ],
      [
        "9",
        "3"
      ],
      [
        "10",
        "2"
      ],
      [
        "10",
        "7"
      ],
      [
        "13",
        "8"
      ],
      [
        "1",
        "16"
      ],
      [
        "2",
        "60"
      ],
      [
        "7",
        "1"
      ],
      [
        "7",
        "3"
      ],
      [
        "7",
        "7"
      ],
      [
        "14",
        "2"
      ],
      [
        "13",
        "6"
      ],
      [
        "11",
        "7"
      ],
      [
        "11",
        "9"
      ],
      [
        "1",
        "60"
      ],
      [
        "1",
        "14"
      ],
      [
        "2",
        "10"
      ],
      [
        "2",
        "40"
      ],
      [
        "2",
        "16"
      ],
      [
        "6",
        "1"
      ],
      [
        "7",
        "4"
      ],
      [
        "8",
        "pi"
      ],
      [
        "20",
        "0"
      ],
      [
        "1",
        "70"
      ],
      [
        "2",
        "30"
      ],
      [
        "2",
        "pi"
      ],
      [
        "5",
        "sqrt"
      ],
      [
        "8",
        "1"
      ],
      [
        "9",
        "1"
      ],
      [
        "i",
        "s"
      ],
      [
        "10",
        "3"
      ],
      [
        "10",
        "6"
      ],
      [
        "10",
        "9"
      ],
      [
        "12",
        "7"
      ],
      [
        "30",
        "0"
      ],
      [
        "16",
        "2"
      ],
      [
        "1",
        "18"
      ],
      [
        "2",
        "50"
      ],
      [
        "3",
        "pi"
      ],
      [
        "4",
        "sqrt"
      ],
      [
        "6",
        "9"
      ],
      [
        "8",
        "3"
      ],
      [
        "8",
        "6"
      ],
      [
        "9",
        "9"
      ],
      [
        "r",
        "e"
      ],
      [
        "50",
        "0"
      ],
      [
        "60",
        "pi"
      ],
      [
        "15",
        "2"
      ],
      [
        "15",
        "5"
      ],
      [
        "15",
        "6"
      ],
      [
        "25",
        "5"
      ],
      [
        "14",
        "1"
      ],
      [
        "14",
        "3"
      ],
      [
        "13",
        "4"
      ],
      [
        "120",
        "0"
      ],
      [
        "19",
        "3"
      ],
      [
        "37",
        "4"
      ],
      [
        "240",
        "0"
      ],
      [
        "(",
        ")"
      ],
      [
        "(",
        ":"
      ],
      [
        ")",
        ")"
      ],
      [
        "0",
        "2"
      ],
      [
        "0",
        "5"
      ],
      [
        "0",
        "6"
      ],
      [
        "0",
        "8"
      ],
      [
        "1",
        "13"
      ],
      [
        "2",
        "12"
      ],
      [
        "2",
        "20"
      ],
      [
        "2",
        "15"
      ],
      [
        "2",
        "70"
      ],
      [
        "2",
        "25"
      ],
      [
        "2",
        "35"
      ],
      [
        "2",
        "38"
      ],
      [
        "2",
        "39"
      ],
      [
        "2",
        "37"
      ],
      [
        "2",
        "31"
      ],
      [
        "2",
        "200"
      ],
      [
        "3",
        "S"
      ],
      [
        "3",
        "10"
      ],
      [
        "3",
        "40"
      ],
      [
        "3",
        "15"
      ],
      [
        "3",
        "25"
      ],
      [
        "3",
        "18"
      ],
      [
        "3",
        "11"
      ],
      [
        "3",
        "38"
      ],
      [
        "3",
        "108"
      ],
      [
        "4",
        "20"
      ],
      [
        "4",
        "70"
      ],
      [
        "4",
        "18"
      ],
      [
        "4",
        "pi"
      ],
      [
        "5",
        "25"
      ],
      [
        "5",
        "75"
      ],
      [
        "5",
        "pi"
      ],
      [
        "6",
        "25"
      ],
      [
        "7",
        "32"
      ],
      [
        "7",
        "38"
      ],
      [
        "8",
        "9"
      ],
      [
        "8",
        "55"
      ],
      [
        "8",
        "sqrt"
      ],
      [
        "9",
        "4"
      ],
      [
        "9",
        "7"
      ],
      [
        "9",
        "8"
      ],
      [
        "9",
        "pi"
      ],
      [
        "a",
        "t"
      ],
      [
        "h",
        "at"
      ],
      [
        "i",
        "re"
      ],
      [
        "q",
        "u"
      ],
      [
        "t",
        "hat"
      ],
      [
        "10",
        "pi"
      ],
      [
        "12",
        "1"
      ],
      [
        "12",
        "9"
      ],
      [
        "12",
        "pi"
      ],
      [
        "40",
        "8"
      ],
      [
        "30",
        "5"
      ],
      [
        "20",
        "5"
      ],
      [
        "20",
        "7"
      ],
      [
        "20",
        "a"
      ],
      [
        "20",
        "10"
      ],
      [
        "15",
        "1"
      ],
      [
        "15",
        "3"
      ],
      [
        "15",
        "4"
      ],
      [
        "15",
        "8"
      ],
      [
        "15",
        "9"
      ],
      [
        "15",
        "20"
      ],
      [
        "15",
        "sqrt"
      ],
      [
        "15",
        "pi"
      ],
      [
        "15",
        "74"
      ],
      [
        "70",
        "7"
      ],
      [
        "25",
        "1"
      ],
      [
        "25",
        "9"
      ],
      [
        "35",
        "7"
      ],
      [
        "16",
        "4"
      ],
      [
        "16",
        "5"
      ],
      [
        "16",
        "6"
      ],
      [
        "16",
        "7"
      ],
      [
        "16",
        "8"
      ],
      [
        "16",
        "9"
      ],
      [
        "16",
        "sqrt"
      ],
      [
        "16",
        "pi"
      ],
      [
        "14",
        "7"
      ],
      [
        "14",
        "9"
      ],
      [
        "14",
        "sqrt"
      ],
      [
        "13",
        "2"
      ],
      [
        "13",
        "3"
      ],
      [
        "13",
        "9"
      ],
      [
        "13",
        "sqrt"
      ],
      [
        "13",
        "pi"
      ],
      [
        "24",
        "6"
      ],
      [
        "18",
        "8"
      ],
      [
        "18",
        "9"
      ],
      [
        "32",
        "pi"
      ],
      [
        "28",
        "8"
      ],
      [
        "22",
        "2"
      ],
      [
        "27",
        "2"
      ],
      [
        "27",
        "3"
      ],
      [
        "27",
        "pi"
      ],
      [
        "34",
        "pi"
      ],
      [
        "17",
        "4"
      ],
      [
        "17",
        "8"
      ],
      [
        "17",
        "sqrt"
      ],
      [
        "17",
        "pi"
      ],
      [
        "64",
        "6"
      ]
    ]
  }
}